<?php 
	$res = array(
		"ret"=>array(
			/* 砸蛋时传递的 */
			"allow"=>true, // 是否允许砸或抢
			"eggType"=>1, // 蛋的类型	

/*----------------------------------------------------------------*/

			/* 抢蛋时传递的 */
			// "allow"=>true, // 是否允许砸或抢
			// "eggType"=>2, // 蛋的类型 抢蛋界面只会有1,2
			// "eggHistory"=>array(2,5,1), // 砸蛋的历史记录
			// "giftName"=>"美国iRobot Braava381",
			// "giftDesc"=>"智能家庭拖地擦地机器人",
			// "eggTitle"=>"获得iRobot智能拖地擦地机器人", // 抢蛋弹框界面显示的获奖名称
			// "eggGotInfo"=>"用户3465从用户2423那里抢得了邋遢蛋", // 抢蛋弹框界面显示的：这个奖品是砸蛋用户领取的，还是别的用户抢的。
			// "eggStatus"=>0 // 抢蛋操作时，蛋的状态。0已领取 1未领取冰封状态 2可抢状态
		),
		"success"=>true
	);

	// 1喜蛋(华为P10) 2邋遢蛋（扫地） 3复活蛋 4烟雾蛋 5查页蛋 6申请蛋

	echo json_encode($res);
 ?>